betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_sd.h
/** @defgroup SD_Exported_Functions_Group2 Input and Output operation functions
  * @{
  */
/* Blocking mode: Polling */
DAL_StatusTypeDef DAL_SD_ReadBlocks(SD_HandleTypeDef *hsd, uint8_t *pData, uint32_t BlockAdd, uint32_t NumberOfBlocks, uint32_t Timeout);
DAL_StatusTypeDef DAL_SD_WriteBlocks(SD_HandleTypeDef *hsd, uint8_t *pData, uint32_t BlockAdd, uint32_t NumberOfBlocks, uint32_t Timeout);
DAL_StatusTypeDef DAL_SD_Erase(SD_HandleTypeDef *hsd, uint32_t BlockStartAdd, uint32_t BlockEndAdd);
/* Non-Blocking mode: IT */
DAL_StatusTypeDef DAL_SD_ReadBlocks_IT(SD_HandleTypeDef *hsd, uint8_t *pData, uint32_t BlockAdd, uint32_t NumberOfBlocks);
DAL_StatusTypeDef DAL_SD_WriteBlocks_IT(SD_HandleTypeDef *hsd, uint8_t *pData, uint32_t BlockAdd, uint32_t NumberOfBlocks);
/* Non-Blocking mode: DMA */
DAL_StatusTypeDef DAL_SD_ReadBlocks_DMA(SD_HandleTypeDef *hsd, uint8_t *pData, uint32_t BlockAdd, uint32_t NumberOfBlocks);
DAL_StatusTypeDef DAL_SD_WriteBlocks_DMA(SD_HandleTypeDef *hsd, uint8_t *pData, uint32_t BlockAdd, uint32_t NumberOfBlocks);

void DAL_SD_IRQHandler(SD_HandleTypeDef *hsd);

/* Callback in non blocking modes (DMA) */
void DAL_SD_TxCpltCallback(SD_HandleTypeDef *hsd);
void DAL_SD_RxCpltCallback(SD_HandleTypeDef *hsd);
void DAL_SD_ErrorCallback(SD_HandleTypeDef *hsd);
void DAL_SD_AbortCallback(SD_HandleTypeDef *hsd);

#if defined (USE_DAL_SD_REGISTER_CALLBACKS) && (USE_DAL_SD_REGISTER_CALLBACKS == 1U)
/* SD callback registering/unregistering */
DAL_StatusTypeDef DAL_SD_RegisterCallback  (SD_HandleTypeDef *hsd, DAL_SD_CallbackIDTypeDef CallbackId, pSD_CallbackTypeDef pCallback);
DAL_StatusTypeDef DAL_SD_UnRegisterCallback(SD_HandleTypeDef *hsd, DAL_SD_CallbackIDTypeDef CallbackId);
#endif /* USE_DAL_SD_REGISTER_CALLBACKS */

/**
  * @}
  */
  
/** @defgroup SD_Exported_Functions_Group3 Peripheral Control functions
  * @{
  */
DAL_StatusTypeDef DAL_SD_ConfigWideBusOperation(SD_HandleTypeDef *hsd, uint32_t WideMode);
/**
  * @}
  */

/** @defgroup SD_Exported_Functions_Group4 SD card related functions
  * @{
  */
DAL_StatusTypeDef       DAL_SD_SendSDStatus(SD_HandleTypeDef *hsd, uint32_t *pSDstatus);
DAL_SD_CardStateTypeDef DAL_SD_GetCardState(SD_HandleTypeDef *hsd);
DAL_StatusTypeDef       DAL_SD_GetCardCID(SD_HandleTypeDef *hsd, DAL_SD_CardCIDTypeDef *pCID);
DAL_StatusTypeDef       DAL_SD_GetCardCSD(SD_HandleTypeDef *hsd, DAL_SD_CardCSDTypeDef *pCSD);
DAL_StatusTypeDef       DAL_SD_GetCardStatus(SD_HandleTypeDef *hsd, DAL_SD_CardStatusTypeDef *pStatus);
DAL_StatusTypeDef       DAL_SD_GetCardInfo(SD_HandleTypeDef *hsd, DAL_SD_CardInfoTypeDef *pCardInfo);
/**
  * @}
  */

/** @defgroup SD_Exported_Functions_Group5 Peripheral State and Errors functions
  * @{
  */
DAL_SD_StateTypeDef DAL_SD_GetState(SD_HandleTypeDef *hsd);
uint32_t DAL_SD_GetError(SD_HandleTypeDef *hsd);
/**
  * @}
  */

/** @defgroup SD_Exported_Functions_Group6 Perioheral Abort management
  * @{
  */
DAL_StatusTypeDef DAL_SD_Abort(SD_HandleTypeDef *hsd);
DAL_StatusTypeDef DAL_SD_Abort_IT(SD_HandleTypeDef *hsd);
/**
  * @}
  */
    
/* Private types -------------------------------------------------------------*/
/** @defgroup SD_Private_Types SD Private Types
  * @{
  */

/**
  * @}
  */ 

/* Private defines -----------------------------------------------------------*/
/** @defgroup SD_Private_Defines SD Private Defines
  * @{
  */

/**
  * @}
  */ 
          
/* Private variables ---------------------------------------------------------*/
/** @defgroup SD_Private_Variables SD Private Variables
  * @{
  */

/**
  * @}
  */ 

/* Private constants ---------------------------------------------------------*/
/** @defgroup SD_Private_Constants SD Private Constants
  * @{
  */

/**
  * @}
  */ 

/* Private macros ------------------------------------------------------------*/
/** @defgroup SD_Private_Macros SD Private Macros
  * @{
  */

/**
  * @}
  */

/* Private functions prototypes ----------------------------------------------*/
/** @defgroup SD_Private_Functions_Prototypes SD Private Functions Prototypes
  * @{
  */

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/** @defgroup SD_Private_Functions SD Private Functions
  * @{
  */

/**
  * @}
  */


/**
  * @}
  */ 

/**
  * @}
  */

/**
  * @}
  */

#endif /* SDIO */

#ifdef __cplusplus
}
#endif


#endif /* APM32F4xx_DAL_SD_H */ 
